BP_Portfolio/app/controllers/posts_controller.rb

SELECT * FROM `posts`
---
  def index
    @posts = Post.all

SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
---
  def show
    @post = Post.find(params[:id])

SELECT * FROM `posts` WHERE (`posts`.`id` = 4)
---
  def edit
    @post = Post.find(params[:id])

INSERT INTO `posts` (`title`, `subtitle`, `body`, `created_at`, `updated_at`) VALUES('First Post', 'test', 'First Blog Post', '2012-11-10 04:44:32', '2012-11-10 04:44:32')
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

SELECT * FROM `posts` WHERE (`posts`.`id` = 4)
UPDATE `posts` SET `title` = 'About This Site', `subtitle` = 'The Details...', `body` = 'This site was built using HTML5, CSS3, Ruby on Rails and JQuery.\r\n\r\nI see this site is a golden opportunity to strengthen my skills with the aforementioned technologies, so most of the site functionality has been hand-coded by me, even where there are many plugins, frameworks, etc. to accomplish the same tasks. I\'d never take this approach with my professional work, but since I have no deadlines with regards to this site I feel like I\'d be cheating myself out of knowledge and experience if I did it any other way.\r\n\r\nThat being said, I plan on using this blog to share my development experience in an effort to help others who are facing the same types of problems. Stay posted!', `updated_at` = '2012-11-18 18:35:06' WHERE `id` = 6
---
  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])

SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
DELETE FROM `posts` WHERE `id` = 1
---
  def destroy
    @post = Post.find(params[:id])
    @post.destroy