BP_Portfolio/app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO `users` (`email`, `password_hash`, `password_salt`, `created_at`, `updated_at`) VALUES('bpask1337@gmail.com', '$2a$10$TacgTFoL9ucJKiFilIPJze8/HnpuXc0PU9ctqtPG8t5rwSAAfUehW', '$2a$10$TacgTFoL9ucJKiFilIPJze', '2012-11-17 21:33:53', '2012-11-17 21:33:53')